>>===== MODE =====>>
citation-suppress_trailing_punctuation
<<===== MODE =====<<

>>===== OPTIONS =====>>
{
    "wrap_url_and_doi": true
}
<<===== OPTIONS =====<<

>>===== KEYS =====>>
[
  "W6GC67VL"
]
<<===== KEYS =====<<

>>===== DESCRIPTION =====>>
Initial test checkin
<<===== DESCRIPTION =====<<

>>===== RESULT =====>>
2006 Ariz. Legis. Serv. 45 (West)
<<===== RESULT =====<<

>>===== CITATION-ITEMS =====>>
[
  [
    {
      "id": "W6GC67VL",
      "position": 0
    }
  ]
]
<<===== CITATION-ITEMS =====<<

>>===== INPUT =====>>
[
  {
    "id": "W6GC67VL",
    "type": "legislation",
    "container-title": "Ariz. Legis. Serv.",
    "page": "45",
    "publisher": "West",
    "jurisdiction": "us:az",
    "collection-number": "2006"
  }
]
<<===== INPUT =====<<