>>===== MODE =====>>
citation-suppress_trailing_punctuation
<<===== MODE =====<<

>>===== OPTIONS =====>>
{
    "wrap_url_and_doi": true
}
<<===== OPTIONS =====<<

>>===== KEYS =====>>
[
  "HXBVYWRG"
]
<<===== KEYS =====<<

>>===== DESCRIPTION =====>>
Initial test checkin
<<===== DESCRIPTION =====<<

>>===== RESULT =====>>
2006 CEC (CCH) 45
<<===== RESULT =====<<

>>===== CITATION-ITEMS =====>>
[
  [
    {
      "id": "HXBVYWRG",
      "position": 0
    }
  ]
]
<<===== CITATION-ITEMS =====<<

>>===== INPUT =====>>
[
  {
    "id": "HXBVYWRG",
    "type": "legal_case",
    "container-title": "CEC",
    "authority": "ecj",
    "page": "45",
    "publisher": "CCH",
    "jurisdiction": "eu.int:cjeu",
    "collection-number": "2006"
  }
]
<<===== INPUT =====<<